ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_c29_diag_regs.xml
<module id="C29_DIAG_REGS" HW_revision="" description="C29 DIAG Registers">
	<register id="FLTEMU_CONFIG" width="32" page="0" offset="0x0" instances="1" instaddr="4" internal="0" description="Fault emulation configuration registerr">
		<bitfield id="ENABLE" description="Fault emulation enable" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="DBL_BIT_INJ_EN" description="Double bit injection enable" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="Write Key" begin="15" end="8" width="8" rwaccess="RW"/>
	</register>
	<register id="FLTEMU_ACCGRPSEL" width="32" page="0" offset="0x4" instances="1" instaddr="4" internal="0" description="Fault emulation access information group selection register">
		<bitfield id="CTRL_GROUP_SEL" description="CTRL group selection" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="DATA_GROUP_SEL" description="DATA READ1 control information bus selection" begin="15" end="8" width="8" rwaccess="RW"/>
	</register>
	<register id="FLTEMU_BITSEL" width="32" page="0" offset="0x8" instances="1" instaddr="4" internal="0" description="Fault emulation bitsel">
		<bitfield id="BITSEL" description="Fault emulation bitselection" begin="6" end="0" width="7" rwaccess="RW"/>
	</register>
	<register id="FLTEMU_ADDR" width="32" page="0" offset="0xc" instances="1" instaddr="4" internal="0" description="Fault emulation access address register">
		<bitfield id="ADDR" description="Fault emulation address" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="TMU_ROM_PAR_FORCE" width="32" page="0" offset="0x10" instances="1" instaddr="4" internal="0" description="Force TMU ROM Parity error">
		<bitfield id="TMU_ROM_PAR_FORCE" description="Fault emulation enable" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="Write Key" begin="15" end="8" width="8" rwaccess="RW"/>
	</register>
</module>
